*** Example: Internet Usage 

 #+BEGIN_SRC R :file plot.svg :results graphics file
www_usage <- as_tsibble(WWWusage)

www_usage %>% autoplot(value) +
    xlab("Minute") + ylab("Number of Users")
 #+END_SRC

 We can use time series cross validation to compare the one step forecast accuracy of the three methods

 #+BEGIN_SRC R :post round-tbl[:colnames yes](*this*)
www_usage %>%
    stretch_tsibble(.init = 10) %>%
    model(SES = ETS(value ~ error("A") + trend("N") + season("N")),
          Holt = ETS(value ~ error("A") + trend("A") + season("N")),
          Damped = ETS(value ~ error("A") + trend("Ad") + season("N"))) %>%
    forecast(h = 1) %>%
    accuracy(www_usage)
 #+END_SRC

 #+RESULTS:
 | .model | .type |  ME | RMSE | MAE | MPE | MAPE | MASE | ACF1 |
 |--------+-------+-----+------+-----+-----+------+------+------|
 | Damped | Test  | 0.3 |  3.7 | 3.0 | 0.3 |  2.3 |  0.7 |  0.3 |
 | Holt   | Test  | 0.1 |  3.9 | 3.2 | 0.2 |  2.4 |  0.7 |  0.3 |
 | SES    | Test  | 1.5 |  6.0 | 4.8 | 0.9 |  3.5 |  1.1 |  0.8 |

 From the table above, we see that Damped Holt's method performs best with respect to both MAE or RMSE values. 

 #+BEGIN_SRC R :post round-tbl[:colnames yes](*this*)
fit <- www_usage %>%
    model(Damped = ETS(value ~ error("A") + trend("Ad") + season("N")))

fit %>% tidy
 #+END_SRC

 #+RESULTS:
 | .model | term  | estimate |
 |--------+-------+----------|
 | Damped | alpha |      1.0 |
 | Damped | beta  |      1.0 |
 | Damped | phi   |      0.8 |
 | Damped | l     |     90.4 |
 | Damped | b     |     -0.0 |

 The smoothing parameter for the slope is 1, indicating the trend changes to mostly reflect the slope between the last two minutes of internet usage. The value of alpha is 1, showing that the level reacts strongly to each observation. 

 #+BEGIN_SRC R :post round-tbl[:colnames yes](*this*)
fit %>%
    forecast(h = 10) %>%
    autoplot(www_usage) +
    xlab("Minute") + ylab("Number of Users")
 #+END_SRC

